In [ ]:
#Q1: Some of the facilities charge a fee to members, but some do not.
#Write a SQL query to produce a list of the names of the facilities that do. */

SELECT *
FROM Facilities
WHERE membercost > 0
LIMIT 0 , 30;

In [ ]:
#Q2: How many facilities do not charge a fee to members? */

SELECT *
FROM Facilities
WHERE membercost =0
LIMIT 0 , 30;

In [ ]:
#Q3: Write an SQL query to show a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost. Return the facid, facility name, member cost, and monthly maintenance of the facilities in question. */

SELECT facid, name, membercost, monthlymaintenance
FROM `Facilities`
WHERE membercost >0
AND membercost < ( .2 * monthlymaintenance )
LIMIT 0 , 30;

In [ ]:
#Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5. Try writing the query without using the OR operator. */

SELECT *
FROM `Facilities`
WHERE facid
IN ( 1, 5 )
LIMIT 0 , 30;

In [ ]:
#Q5: Produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than $100. Return the name and monthly maintenance of the facilities
#in question. */

SELECT name, monthlymaintenance,
CASE 
	WHEN monthlymaintenance > 100 THEN "expensive"
	ELSE "cheap" 
END AS Price
FROM `Facilities`;

In [ ]:
#Q6: You'd like to get the first and last name of the last member(s) who signed up. Try not to use the LIMIT clause for your solution. */

SELECT surname, firstname
FROM `Members`
ORDER BY joindate DESC
LIMIT 3;

In [ ]:
#Q7: Produce a list of all members who have used a tennis court. 
#Include in your output the name of the court, and the name of the memberformatted as a single column. 
#Ensure no duplicate data, and order by the member name. */
#join tables with facilities
#Where ...
#then join table with members

SELECT firstname, surname, (SELECT name, facid FROM Facilities) AS name
FROM Members AS m 
    INNER JOIN Bookings AS b
        ON m.memid = b.memid
WHERE facid IN (0,1)

In [ ]:
# Q8: Produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30. 
#Remember that guests have different costs to members (the listed costs are per half-hour 'slot'), and the guest user's ID is always 0. 
#Include in your output the name of the facility, the name of the member formatted as a single column, and the cost. Order by descending cost, and do not use any subqueries.
#Where guestcost > 30 
#timestamp has date and time; extract the date (larger than less than)
#multiply slot(.5) by cost 

Select memid, f.name, CONVERT("2012-09-14", DATE)
FROM Bookings 
FULL JOIN Facilities AS f
WHERE f.guestcost > 30
ORDER BY f.guestcost DESC

In [ ]:
# Q9: This time, produce the same result as in Q8, but using a subquery